In [26]:
import pandas as pd # pandas 는 일종의 패키지

pasdas에는 
- dataframe : table
- series: column
가 존재  
numpy엔 array가 있듯이
pandas엔 이 2가지가 있다  
series가 합쳐지면 dataframe이다  
벡터 와 행렬 같은 느낌인것 같지만
numpy와 달리
dataframe은 데이터 분석을 유용하게 만들기 위한 패키지 -> R에서 왔다 (통계 분석용 tool)
dataframe이라는 자료구조
table 정보를 그대로 가져온다. -> column name과 index 와 value를 그대로 가져와서 각각 구분지어서 담는다.
series는 각각의 구성요소
numpy의 경우에는 column name 적힌 행 따로 읽고 index 적힌 열 따로 읽어들여 담아야 한다.

In [2]:
#numpy와 비교
import numpy as np
data = np.array([1,2,3,4,5])
data

array([1, 2, 3, 4, 5])

In [3]:
data = pd.Series([1,2,3,4,5])  #series의 첫글자 대문자!
data

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
data_2 = np.array([[1,2,3,4,5],[6,7,8,9,10]])
data_2

array([[ 1,  2,  3,  4,  5],
       [ 6,  7,  8,  9, 10]])

In [5]:
data_2 = pd.Series([[1,2,3,4,5],[6,7,8,9,10]])  #[1,2,3,4,5] 이 하나의 리스트가 하나의 엑셀의 셀 안에 담긴 꼴
data_2

0     [1, 2, 3, 4, 5]
1    [6, 7, 8, 9, 10]
dtype: object

In [6]:
#[1,2,3,4,5] 이 하나의 리스트가 하나의 엑셀의 셀 안에 담긴 꼴 -> 그래서 data_2를 하나의 table로 담으려면

data_2 = pd.DataFrame([[1,2,3,4,5],[6,7,8,9,10]])
data_2

   0  1  2  3   4
0  1  2  3  4   5
1  6  7  8  9  10

In [7]:
# data_2 = pd.DataFrame([[1,2,3,4,5],[6,7,8,9,10]]) -> [1,2,3,4,5],[]  얘네가 value

data_2 = pd.DataFrame([[1,2,3,4,5],[6,7,8,9,10]], columns=['a','b','c','d','e'], index = ['one','two'])
data_2

     a  b  c  d   e
one  1  2  3  4   5
two  6  7  8  9  10

In [8]:
data_2['a'] #열 읽어들이기

one    1
two    6
Name: a, dtype: int64

In [9]:
#data_2['one'] # 오류뜸
data_2.loc['one'] # = iloc = ix   -> loc = location
                  #loc, ix는 되는데 iloc안됨 ->loc은 이름(문자)로 접근, iloc은 이름으로 접근하지 않고 순서(숫자)로 접근한다.
                  #ix는 문자, 숫자 둘 다 가능
                  # index 숫자, 문자 둘 다 가능 -> 그래서 읽는 함수 다양

a    1
b    2
c    3
d    4
e    5
Name: one, dtype: int64

In [10]:
data_2.iloc[0]  #iloc은 순서로 접근한다.

a    1
b    2
c    3
d    4
e    5
Name: one, dtype: int64

In [11]:
data_2.ix['one']

C:\ProgramData\Anaconda3\envs\finance\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

a    1
b    2
c    3
d    4
e    5
Name: one, dtype: int64

In [12]:
data_2.ix[0]  #ix도 순서로도 인식

C:\ProgramData\Anaconda3\envs\finance\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

a    1
b    2
c    3
d    4
e    5
Name: one, dtype: int64

In [13]:
data_3 = pd.DataFrame([[1,2,3],[4,5,6]])   # index 안 넣으면 숫자로 idexing된다. 그리고 그 숫자는 name으로도 간주된다
data_3                                     # 그래서 출력되는 숫자 0,1 은 숫자, 문자 둘 다로 인식된다.

   0  1  2
0  1  2  3
1  4  5  6

In [14]:
print(data_3.iloc[0])
print(data_3.loc[0])
print(data_3.ix[0])

0    1
1    2
2    3
Name: 0, dtype: int64
0    1
1    2
2    3
Name: 0, dtype: int64
0    1
1    2
2    3
Name: 0, dtype: int64

C:\ProgramData\Anaconda3\envs\finance\lib\site-packages\ipykernel_launcher.py:3: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  This is separate from the ipykernel package so we can avoid doing imports until

In [15]:
#slicing
data_3.iloc[0:2]  #iloc은 index 숫자로 인식해서 [0:2]

   0  1  2
0  1  2  3
1  4  5  6

In [16]:
data_3.loc[0:2]

   0  1  2
0  1  2  3
1  4  5  6

In [17]:
data_3.loc[0:1]   #loc은 index 문자로 인식해서 [0:2] = [0:1] 같은 결과 ->문자로 인식하면 0-1까지 둘다 출력, 숫자는 0부터 2 앞까지

   0  1  2
0  1  2  3
1  4  5  6

In [18]:
data_3.ix[0:2]

C:\ProgramData\Anaconda3\envs\finance\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

   0  1  2
0  1  2  3
1  4  5  6

In [19]:
data = np.array([i for i in range(100)]).reshape(10,10)
#data = np.array([i for i in range(100)])
#data = data.reshape(10,10)             위와 같은코드


data_3 = pd.DataFrame(data)

data_3

    0   1   2   3   4   5   6   7   8   9
0   0   1   2   3   4   5   6   7   8   9
1  10  11  12  13  14  15  16  17  18  19
2  20  21  22  23  24  25  26  27  28  29
3  30  31  32  33  34  35  36  37  38  39
4  40  41  42  43  44  45  46  47  48  49
5  50  51  52  53  54  55  56  57  58  59
6  60  61  62  63  64  65  66  67  68  69
7  70  71  72  73  74  75  76  77  78  79
8  80  81  82  83  84  85  86  87  88  89
9  90  91  92  93  94  95  96  97  98  99

In [20]:
data_3.iloc[1:5]

    0   1   2   3   4   5   6   7   8   9
1  10  11  12  13  14  15  16  17  18  19
2  20  21  22  23  24  25  26  27  28  29
3  30  31  32  33  34  35  36  37  38  39
4  40  41  42  43  44  45  46  47  48  49

In [21]:
data_3.loc[1:5]

    0   1   2   3   4   5   6   7   8   9
1  10  11  12  13  14  15  16  17  18  19
2  20  21  22  23  24  25  26  27  28  29
3  30  31  32  33  34  35  36  37  38  39
4  40  41  42  43  44  45  46  47  48  49
5  50  51  52  53  54  55  56  57  58  59

In [22]:
data_3.ix[1:5]  #ix는 인덱스를 숫자, 문자 둘다로 인식 그럼 인덱스 정해놓지 않은 상태에선 뭘로 인식할까 -> loc과 같이 문자로 인식

C:\ProgramData\Anaconda3\envs\finance\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

    0   1   2   3   4   5   6   7   8   9
1  10  11  12  13  14  15  16  17  18  19
2  20  21  22  23  24  25  26  27  28  29
3  30  31  32  33  34  35  36  37  38  39
4  40  41  42  43  44  45  46  47  48  49
5  50  51  52  53  54  55  56  57  58  59

stack()
astype() -> 형변환

면접간다고 수업 못들은 부분이 더 있다 꼼꼼히 확인하자!

### Titanic Data

In [23]:
mkdir Dataset

하위 디렉터리 또는 파일 Dataset이(가) 이미 있습니다.

dataset = pd.read_csv('Dataset/train.csv')
dataset

In [24]:
dataset.head()  #앞의 5개

NameError: name 'dataset' is not defined

In [ ]:
dataset.tail()  #뒤의 5개

In [ ]:
dataset.loc[400:404] #중간만 보면? ->슬라이싱하면 row로 잘라준다. ->loc사용 loc은 문자라서 404까지 다나온다.

In [ ]:
dataset.describe() #데이터의 통계      dataframe은 str이 아닌 object

In [ ]:
dataset.info()

- age는 891 중 741밖에 없다 -> 결측치(누락 데이터)가 있다
- 결측치는 어떻게 처리할까 결측된 사람의 정보는 아예 빼나?, 아님 다른 속성을 보고 그 속성이 비슷한 애들의 나이 가져가나?, 아님 평균 나이로 넣을까?

데이터 분석을 위해
데이터 수집 - 전처리 - 분석
다음주                머신러닝(컴퓨터한테 분석시키는거 - 컴퓨터가 알아들을 수 있게 전처리해서 데이터 줘야한다)을 통해

전처리 -cleaning작업과 featyre engineering 작업

cleaning : 결측치를 채워준다거나 문자를 숫자로 바꿔주는 등
feature : 데이터가 가진 feature가 있다 -> ex 사람들의 정보 -> 그냥 넣어주면 
ex) 사람의 나이와 죽음의 관계에 대해 볼때 10대 20대 로 볼땐 경향성이 보이는데 11,12,13 좁은 간격으로 보면 경향성이 보이지 않는다.
                                       -> 1살 간격으로 보는건 잘못된 해석 아닌가 -> 컴퓨터가 잘못 학습할 수 있다.
                                       -> 10살 간격으로 보게 데이터를 가공해서 컴퓨터에 보내줄 수 있다.
전처리 과정의 결과는 사람마다 다를것 -> 어떤 결과가 더 좋은 결과일까
-> 분석 후 결과가 잘 나왔는지 검증하가ㅣ 위해 test set(또 다른 데이터)을 가지고 예측을 해본다. 예측 결과와 기존의 결과 비교대조해서 더 좋은 전처리 과정 가려낸다.

#### dataframe 병합

In [101]:
df_1 = pd.DataFrame([['알라딘', 26],['자스민',25]], columns = ['name','age'])
df_1

  name  age
0  알라딘   26
1  자스민   25

In [102]:
df_2 = pd.DataFrame([['지니', 3000],['자카',50]], columns = ['name','age'])
df_2

  name   age
0   지니  3000
1   자카    50

In [103]:
df = df_1.append(df_2)  #그냥 append쓰면 인덱스가 안이쁨 ignore해주자
df

  name   age
0  알라딘    26
1  자스민    25
0   지니  3000
1   자카    50

In [104]:
df = df_1.append(df_2, ignore_index=True) #false로 하면 두개의 dataframe의 인덱스를 그대로 가져다 씀 true는 새롭게 인덱스 부여
df

  name   age
0  알라딘    26
1  자스민    25
2   지니  3000
3   자카    50

In [105]:
df_3 = pd.DataFrame([['알라딘', 'male'],['자스민','female']], columns = ['name','sex'])
df_3

  name     sex
0  알라딘    male
1  자스민  female

In [106]:
df = df_1.append(df_3)   #원래있는 데이터프레임에 새로운 항목을 가진 dataframe을 합치고 싶었는데.....
df

    age name     sex
0  26.0  알라딘     NaN
1  25.0  자스민     NaN
0   NaN  알라딘    male
1   NaN  자스민  female

In [107]:
df = df_1.merge(df_3)  #merge -> 병합한다. 중복되는 사항을 겹쳐서 병합 -> 기준열은 공통된 컬럼 name을 가진 열이 기준열
df

  name  age     sex
0  알라딘   26    male
1  자스민   25  female

Q. 직업 정보를 추가

In [108]:
#sol_1.
df_4 = pd.DataFrame([['알라딘', '무직'],['자스민','공주']], columns = ['name','job'])

In [109]:
df = df.merge(df_4)
df

  name  age     sex job
0  알라딘   26    male  무직
1  자스민   25  female  공주

In [110]:
df_genie =pd.DataFrame({'name':['지니'], 'age':3000, 'sex':'male', 'job':'fairy'})
df_genie

  name   age   sex    job
0   지니  3000  male  fairy

In [111]:
#sol_2.
df_5 = pd.DataFrame(['무직','공주'], columns = ['job'])

In [112]:
df = df.append(df_genie, ignore_index=True)
df

  name   age     sex    job
0  알라딘    26    male     무직
1  자스민    25  female     공주
2   지니  3000    male  fairy

In [ ]:
pd.concat([df_1,df_3],join='outer')  # concat : 
#하고 join하고 같은거?

In [ ]:
df_country = pd.DataFrame({'name':['알라딘','자스민'],'국적':['아라비아','아라비아']})
df_country

In [ ]:
data = df.merge(df_country)
data

In [ ]:
data = df.merge(df_country, how='left') #how = left, right, inner, outer
data

#data = df.merge(a) -> df와 a가 merge하자
#inner = df와 a 안에 row에 대해서 겹치는 data만 합치자
#outer = df,a 모두 합치고 없는 정보는 빈칸으로 두자
#left = df가 가진 row에 대해서만 merge하자 left 차집합
#right = right 차집합

In [58]:
df_left = pd.DataFrame({'key': ['A','B','C'], 'left': [1,2,3]})
df_left

  key  left
0   A     4
1   B     2
2   C     3

In [63]:
df_right = pd.DataFrame({'key': ['A','B','D'], 'right': [4,5,6]})
df_right

  key  right
0   A      4
1   B      5
2   D      6

In [64]:
df_total = df_left.merge(df_right)
df_total

  key  left  right
0   A     4      4
1   B     2      5

- merge ( on ) #기준열 설정

In [75]:
pd.concat([df_left,df_right],axis=1)

  key  left key  left
0   A     4   A     4
1   B     2   B     5
2   C     3   D     6

-left, right 모두에게 'data'라는 이름의 columns을 추가하되, left와 right에 다른 값을 넣어보셈

In [87]:
df_r = pd.DataFrame({'data':['a','b','c']})
df_right = df_right.merge(df_r)
df_right

  key  left data
0   A     4    a
1   B     5    b
2   D     6    c

In [89]:
df = df_left.merge(df_right, on = 'key')
df

  key  left_x  left_y data
0   A       4       4    a
1   B       2       5    b

key    left    right     -> column이름이 같은 애들을 기준으로 삼는다   
근데 이름이 같아도 서로 다른 타입의 데이터 갖고 있을 수 있으므로 무조건 이름이 같다고 해서 기준열로 삼으면 안된다.   
기준열이 될 애들을 빼서 key로 명시해준다.  
같고 있는 데이터는 같은데 column이름이 다른 경우도 있다.

반대로, 기준열로 삼아야 하는 컬럼이 서로 이름이 다른경우

In [95]:
df_left = pd.DataFrame({'key': ['A','B','C'], 'left': [1,2,3]})
df_right = pd.DataFrame({'name': ['A','B','D'], 'right': [4,5,6]})

In [96]:
df = df_left.merge(df_right, how = 'outer', left_on = 'key', right_on = 'name')   #기준열을 삼고 싶은 열이 있으면 
                                                                                    #left_on, right_on 사용
df

   key  left name  right
0    A   1.0    A    4.0
1    B   2.0    B    5.0
2    C   3.0  NaN    NaN
3  NaN   NaN    D    6.0

In [97]:
df = pd.concat([df_left,df_right])  # concat은 아래로 쌓인다
df

C:\ProgramData\Anaconda3\envs\finance\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

   key  left name  right
0    A   1.0  NaN    NaN
1    B   2.0  NaN    NaN
2    C   3.0  NaN    NaN
0  NaN   NaN    A    4.0
1  NaN   NaN    B    5.0
2  NaN   NaN    D    6.0

In [100]:
df = pd.concat([df_left,df_right], axis = 1)  # axis = 1로 두면 옆으로 쌓인다
df

  key  left name  right
0   A     1    A      4
1   B     2    B      5
2   C     3    D      6

In [115]:
data = pd.DataFrame({'name':['알라딘','자스민','지니'],'age':[26,25,3000]})
data

  name   age
0  알라딘    26
1  자스민    25
2   지니  3000

- data라는 dataframe에 'name'이 '자카'인 데이터가 있는지 궁금하다면?

In [116]:
data[data['name']=='자카']   #data에서 'name'이 자카인 데이터 찾아죠

Empty DataFrame
Columns: [name, age]
Index: []

In [117]:
data['name']=='자카'  #이래서 안나옴

0    False
1    False
2    False
Name: name, dtype: bool

In [118]:
data[data['name']=='지니']

  name   age
2   지니  3000

-data에서 알라딘과 자스민만 뽑아보셈

In [138]:
data[data['name'].isin(['자스민', '알라딘'])]

  name  age
0  알라딘   26
1  자스민   25

- age 기준으로 정렬하고싶다면?

In [141]:
data.sort_values(by=['age'], ascending = False)

  name   age
2   지니  3000
0  알라딘    26
1  자스민    25

- csv로 저장하고 싶다면?

In [142]:
data.to_csv('aladin.csv')

In [143]:
data = pd.read_csv('aladin.csv')
data    #unnamed의 정체는?? -> 저장한 텍스트 파일에 인덱스가 저장되서 생김

   Unnamed: 0 name   age
0           0  알라딘    26
1           1  자스민    25
2           2   지니  3000

In [144]:
data = pd.DataFrame({'name':['알라딘','자스민','지니'],'age':[26,25,3000]})
data.to_csv('aladin.csv', index = False)   #위의 이유로 인덱스는 False로 둔다.

In [145]:
data = pd.read_csv('aladin.csv')   #csv는 구분자가 쉼표인 데이터
data

  name   age
0  알라딘    26
1  자스민    25
2   지니  3000

In [150]:
#데이터를 엑셀로 저장하고 싶다면?
data.to_excel('aladin.xls')
data

  name   age
0  알라딘    26
1  자스민    25
2   지니  3000

In [ ]:
data.to_excel('aladin.xls', index=False)
data

- name column을 인덱스로 사용하고 싶다면?

In [152]:
data = data.set_index('name')
data

       age
name
알라딘     26
자스민     25
지니    3000

In [153]:
# 저장된 csv파일을 읽어들일때
data = pd.read_csv('aladin.csv', index_col=0)
data

       age
name
알라딘     26
자스민     25
지니    3000

In [154]:
data = pd.read_csv('aladin.csv', index_col='name')
data

       age
name
알라딘     26
자스민     25
지니    3000